Revit 2024 API
ParameterTypeId.ViewSolarstudyStillPresetIndex Property
 "Still presets combo"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudyStillPresetIndex { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudyStillPresetIndex As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudyStillPresetIndex {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace